{
  "modal_peak": [
    "This peak is your room shouting back at the speakers. It’s like the bass is hitting a spot where it gets reinforced. A tiny shuffle forward or back often quietens it down without any treatment.",
    "Your room is adding a little ‘whoomph’ at this frequency. Nothing scary, just try pulling the speakers away from the wall a touch."
  ],

  "modal_dip": [
    "This dip means the room is cancelling that note out. Think of it like a hole in the sound field. A small seat or speaker adjustment can fill it in instantly.",
    "You've hit a classic room null, the room is basically eating that frequency. Slide your listening position a few inches and watch it come back to life."
  ],

  "bass_heavy": [
    "Your room adds some warmth down low, normal in most UK lounges, especially with solid brick walls. Pulling the speakers out slightly usually nails it.",
    "Bit of extra beef in the bass. Don’t stress, a few cm of speaker movement often tightens things nicely."
  ],

  "bass_light": [
    "The bass is a bit shy. This is usually because the speakers are too far from the wall or you're sitting in a cancellation zone. Try inching the seat forward.",
    "Low end feels a little lean. If you push the speakers back towards the wall, you'll get more weight instantly."
  ],

  "mid_forward": [
    "Mids are leaning forward, vocals might feel a little too eager. Tweaking toe-in usually does the trick.",
    "This is the classic ‘vocals in your face’ pattern. Reduce toe-in a smidge and it should mellow nicely."
  ],

  "treble_rolloff": [
    "Top end is snoozing a bit, could be tweeter height or toe-in. A tiny angle change usually brings back the sparkle.",
    "Your highs are gently rolling off. Don’t panic, it's often the speaker angle rather than the room."
  ],

  "too_live": [
    "Your room is a bit lively, this is the sound bouncing around with nowhere soft to land. Curtains, cushions or a rug fix this fast.",
    "Reverb is running long, making things sound splashy. A couple of soft furnishings will tighten everything right up."
  ],

  "reflections": [
    "You’ve got strong side reflections. These smear the stereo image. A bit of toe-in or something soft at the reflection point fixes it.",
    "There’s a lot bouncing off the walls early on. This is super common, toe-in or a rug near the speakers helps massively."
  ],

  "overall_good": [
    "This room is doing really well, you’re in the fine-tuning zone now. The fixes here are more about taste than correction.",
    "Great baseline! Room behaviour is already solid. Now we’re just polishing the last few percent."
  ]
}
